In [5]:
import numpy as np 
import pandas as pd

 # Gourp by

In [7]:
data = {'Company':["goog","goog","msft","msft","fb","fb"],
       'Person':["sam","charlie","amy","vanessa","carl","sarah"],
        "sales":[200,120,340,124,243,350]}
data

{'Company': ['goog', 'goog', 'msft', 'msft', 'fb', 'fb'],
 'Person': ['sam', 'charlie', 'amy', 'vanessa', 'carl', 'sarah'],
 'sales': [200, 120, 340, 124, 243, 350]}

In [10]:
df  = pd.DataFrame(data)
df

  Company   Person  sales
0    goog      sam    200
1    goog  charlie    120
2    msft      amy    340
3    msft  vanessa    124
4      fb     carl    243
5      fb    sarah    350

In [14]:
bycompany = df.groupby("Company")
bycompany.mean()

         sales
Company
fb       296.5
goog     160.0
msft     232.0

In [15]:
bycompany.sum()

         sales
Company
fb         593
goog       320
msft       464

In [19]:
bycompany.sum().loc['fb']

sales    593
Name: fb, dtype: int64

In [20]:
df.groupby('Company').sum().loc['fb']

sales    593
Name: fb, dtype: int64

In [21]:
df.groupby('Company').count()

         Person  sales
Company
fb            2      2
goog          2      2
msft          2      2

In [22]:
df.groupby('Company').max()

          Person  sales
Company
fb         sarah    350
goog         sam    200
msft     vanessa    340

In [23]:
df

  Company   Person  sales
0    goog      sam    200
1    goog  charlie    120
2    msft      amy    340
3    msft  vanessa    124
4      fb     carl    243
5      fb    sarah    350

In [26]:
df.groupby("Company").describe().transpose()['fb']

sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: fb, dtype: float64